# Macro Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Macro Properties
Macro Class See Also
---
The Macro type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Description | The macro description. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| MacroModule | The Macro module. |
| Name | The macro name. |

# See Also
Macro Class
Autodesk.Revit.DB.Macros Namespace